[
  {
    "id": 1,
    "title": "Cloud Migration Lab (AWS)",
    "description": "Built and deployed a video processing API supporting multiple formats|Designed AWS-based architecture integrating Cognito (auth), S3 (storage), DynamoDB (metadata), and Parameter Store/Secrets Manager (config)|Deployed using Docker on AWS EC2 with IAM roles for credential-free access",
    "tech_stack": "react, python, aws, dynamoDB, docker",
    "github_url": "https://github.com/bairigao/video-transcoding-full-aws-deployment",
    "color": "text-blue-400"
  },
  {
    "id": 2,
    "title": "school-onboarding-offboarding-platform",
    "description": "A comprehensive web platform for managing the onboarding and offboarding of students and staff in educational institutions. Built with ASP.NET Core 10.0 backend and Next.js 16 frontend, integrated with Snipe-IT for device management.",
    "tech_stack": ".NET, React, Tailwind CSS, Vite",
    "github_url": "https://github.com/bairigao/school-onboarding-offboarding-platform"
  },
  {
    "id": 3,
    "title": "Geo-Intelligence ML System (Industry Project - OreFox)",
    "description": "Developed a Python-based ML platform on Azure for automating geophysical data analysis in mineral exploration|Implemented Dockerized Django backend, deployed via Terraform, and automated workflows using GitHub Actions|Assisted in developing CNN models for gold and copper confidence prediction, visualized via Leaflet and PostGIS",
    "tech_stack": "Azure, Python, Terraform, Docker, Django, Leaflet, PostGIS",
    "github_url": "",
    "color": "text-purple-400"
  },
  {
    "id": 4,
    "title": "Java App – GitHub Action / Project",
    "description": "Automated build and testing processes using GitHub Actions CI/CD workflows|Designed a calendar system linked to personalized AI motivational messages|Integrated OpenAI-based message generation to for daily productivity prompts",
    "tech_stack": "java,github-actions,openai,sql",
    "github_url": "https://github.com/bairigao/Fortune-Cookies-App",
    "color": "text-green-400"
  }
]
